espressif/esp-idf/components/soc/esp32s3/register/soc/lcd_cam_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LCD_CAM_LCD_CLOCK_REG register
 *  LCD clock configuration register
 */
#define LCD_CAM_LCD_CLOCK_REG (DR_REG_LCD_CAM_BASE + 0x0)
/** LCD_CAM_LCD_CLKCNT_N : R/W; bitpos: [5:0]; default: 0;
 *  f<SUB>LCD_PCLK</SUB>
 *  = f<SUB>LCD_CLK</SUB>/(LCD_CAM_LCD_CLKCNT_N + 1) when LCD_CAM_LCD_CLK_EQU_SYSCLK is
 *  0. Note: this field must not be configured to 0.
 */
#define LCD_CAM_LCD_CLKCNT_N    0x0000003FU
#define LCD_CAM_LCD_CLKCNT_N_M  (LCD_CAM_LCD_CLKCNT_N_V << LCD_CAM_LCD_CLKCNT_N_S)
#define LCD_CAM_LCD_CLKCNT_N_V  0x0000003FU
#define LCD_CAM_LCD_CLKCNT_N_S  0
/** LCD_CAM_LCD_CLK_EQU_SYSCLK : R/W; bitpos: [6]; default: 0;
 *  1: f<SUB>LCD_PCLK</SUB>
 *  = f<SUB>LCD_CLK</SUB>. 0: f<SUB>LCD_PCLK</SUB>
 *  = f<SUB>LCD_CLK</SUB>/(LCD_CAM_LCD_CLKCNT_N + 1).
 */
#define LCD_CAM_LCD_CLK_EQU_SYSCLK    (BIT(6))
#define LCD_CAM_LCD_CLK_EQU_SYSCLK_M  (LCD_CAM_LCD_CLK_EQU_SYSCLK_V << LCD_CAM_LCD_CLK_EQU_SYSCLK_S)
#define LCD_CAM_LCD_CLK_EQU_SYSCLK_V  0x00000001U
#define LCD_CAM_LCD_CLK_EQU_SYSCLK_S  6
/** LCD_CAM_LCD_CK_IDLE_EDGE : R/W; bitpos: [7]; default: 0;
 *  1: LCD_PCLK line is high in idle. 0: LCD_PCLK line is low in idle.
 */
#define LCD_CAM_LCD_CK_IDLE_EDGE    (BIT(7))
#define LCD_CAM_LCD_CK_IDLE_EDGE_M  (LCD_CAM_LCD_CK_IDLE_EDGE_V << LCD_CAM_LCD_CK_IDLE_EDGE_S)
#define LCD_CAM_LCD_CK_IDLE_EDGE_V  0x00000001U
#define LCD_CAM_LCD_CK_IDLE_EDGE_S  7
/** LCD_CAM_LCD_CK_OUT_EDGE : R/W; bitpos: [8]; default: 0;
 *  1: LCD_PCLK is high in the first half clock cycle. 0: LCD_PCLK is low in the first
 *  half clock cycle.
 */
#define LCD_CAM_LCD_CK_OUT_EDGE    (BIT(8))
#define LCD_CAM_LCD_CK_OUT_EDGE_M  (LCD_CAM_LCD_CK_OUT_EDGE_V << LCD_CAM_LCD_CK_OUT_EDGE_S)
#define LCD_CAM_LCD_CK_OUT_EDGE_V  0x00000001U
#define LCD_CAM_LCD_CK_OUT_EDGE_S  8
/** LCD_CAM_LCD_CLKM_DIV_NUM : R/W; bitpos: [16:9]; default: 0;
 *  Integral LCD clock divider value.
 */
#define LCD_CAM_LCD_CLKM_DIV_NUM    0x000000FFU
#define LCD_CAM_LCD_CLKM_DIV_NUM_M  (LCD_CAM_LCD_CLKM_DIV_NUM_V << LCD_CAM_LCD_CLKM_DIV_NUM_S)
#define LCD_CAM_LCD_CLKM_DIV_NUM_V  0x000000FFU
#define LCD_CAM_LCD_CLKM_DIV_NUM_S  9
/** LCD_CAM_LCD_CLKM_DIV_B : R/W; bitpos: [22:17]; default: 0;
 *  Fractional clock divider numerator value.
 */
#define LCD_CAM_LCD_CLKM_DIV_B    0x0000003FU
#define LCD_CAM_LCD_CLKM_DIV_B_M  (LCD_CAM_LCD_CLKM_DIV_B_V << LCD_CAM_LCD_CLKM_DIV_B_S)
#define LCD_CAM_LCD_CLKM_DIV_B_V  0x0000003FU
#define LCD_CAM_LCD_CLKM_DIV_B_S  17
/** LCD_CAM_LCD_CLKM_DIV_A : R/W; bitpos: [28:23]; default: 0;
 *  Fractional clock divider denominator value.
 */
#define LCD_CAM_LCD_CLKM_DIV_A    0x0000003FU
#define LCD_CAM_LCD_CLKM_DIV_A_M  (LCD_CAM_LCD_CLKM_DIV_A_V << LCD_CAM_LCD_CLKM_DIV_A_S)
#define LCD_CAM_LCD_CLKM_DIV_A_V  0x0000003FU
#define LCD_CAM_LCD_CLKM_DIV_A_S  23
/** LCD_CAM_LCD_CLK_SEL : R/W; bitpos: [30:29]; default: 0;
 *  Select LCD module source clock. 0: clock source is disabled. 1: XTAL_CLK. 2:
 *  PLL_D2_CLK. 3: PLL_F160M_CLK.
 */
#define LCD_CAM_LCD_CLK_SEL    0x00000003U
#define LCD_CAM_LCD_CLK_SEL_M  (LCD_CAM_LCD_CLK_SEL_V << LCD_CAM_LCD_CLK_SEL_S)
#define LCD_CAM_LCD_CLK_SEL_V  0x00000003U
#define LCD_CAM_LCD_CLK_SEL_S  29
/** LCD_CAM_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Set this bit to force enable the clock for all configuration registers. Clock gate
 *  is not used.
 */
#define LCD_CAM_CLK_EN    (BIT(31))
#define LCD_CAM_CLK_EN_M  (LCD_CAM_CLK_EN_V << LCD_CAM_CLK_EN_S)
#define LCD_CAM_CLK_EN_V  0x00000001U
#define LCD_CAM_CLK_EN_S  31

/** LCD_CAM_CAM_CTRL_REG register
 *  Camera clock configuration register
 */
#define LCD_CAM_CAM_CTRL_REG (DR_REG_LCD_CAM_BASE + 0x4)
/** LCD_CAM_CAM_STOP_EN : R/W; bitpos: [0]; default: 0;
 *  Camera stop enable signal, 1: camera stops when GDMA Rx FIFO is full. 0: Do not
 *  stop.
 */
#define LCD_CAM_CAM_STOP_EN    (BIT(0))
#define LCD_CAM_CAM_STOP_EN_M  (LCD_CAM_CAM_STOP_EN_V << LCD_CAM_CAM_STOP_EN_S)
#define LCD_CAM_CAM_STOP_EN_V  0x00000001U
#define LCD_CAM_CAM_STOP_EN_S  0
/** LCD_CAM_CAM_VSYNC_FILTER_THRES : R/W; bitpos: [3:1]; default: 0;
 *  Filter threshold value for CAM_VSYNC signal.
 */
#define LCD_CAM_CAM_VSYNC_FILTER_THRES    0x00000007U
#define LCD_CAM_CAM_VSYNC_FILTER_THRES_M  (LCD_CAM_CAM_VSYNC_FILTER_THRES_V << LCD_CAM_CAM_VSYNC_FILTER_THRES_S)
#define LCD_CAM_CAM_VSYNC_FILTER_THRES_V  0x00000007U
#define LCD_CAM_CAM_VSYNC_FILTER_THRES_S  1
/** LCD_CAM_CAM_UPDATE : R/W; bitpos: [4]; default: 0;
 *  1: Update camera registers. This bit is cleared by hardware. 0: Do not care.
 */
#define LCD_CAM_CAM_UPDATE    (BIT(4))
#define LCD_CAM_CAM_UPDATE_M  (LCD_CAM_CAM_UPDATE_V << LCD_CAM_CAM_UPDATE_S)
#define LCD_CAM_CAM_UPDATE_V  0x00000001U
#define LCD_CAM_CAM_UPDATE_S  4
/** LCD_CAM_CAM_BYTE_ORDER : R/W; bitpos: [5]; default: 0;
 *  1: Invert data byte order, only valid in 16-bit mode. 0: Do not change.
 */
#define LCD_CAM_CAM_BYTE_ORDER    (BIT(5))
#define LCD_CAM_CAM_BYTE_ORDER_M  (LCD_CAM_CAM_BYTE_ORDER_V << LCD_CAM_CAM_BYTE_ORDER_S)
#define LCD_CAM_CAM_BYTE_ORDER_V  0x00000001U
#define LCD_CAM_CAM_BYTE_ORDER_S  5
/** LCD_CAM_CAM_BIT_ORDER : R/W; bitpos: [6]; default: 0;
 *  1: Change data bit order, change CAM_DATA_in[7:0] to CAM_DATA_in[0:7] in 8-bit
 *  mode, and bits[15:0] to bits[0:15] in 16-bit mode.  0: Do not change.
 */
#define LCD_CAM_CAM_BIT_ORDER    (BIT(6))
#define LCD_CAM_CAM_BIT_ORDER_M  (LCD_CAM_CAM_BIT_ORDER_V << LCD_CAM_CAM_BIT_ORDER_S)
#define LCD_CAM_CAM_BIT_ORDER_V  0x00000001U
#define LCD_CAM_CAM_BIT_ORDER_S  6
/** LCD_CAM_CAM_LINE_INT_EN : R/W; bitpos: [7]; default: 0;
 *  1: Enable to generate LCD_CAM_CAM_HS_INT. 0: Disable.
 */
#define LCD_CAM_CAM_LINE_INT_EN    (BIT(7))
#define LCD_CAM_CAM_LINE_INT_EN_M  (LCD_CAM_CAM_LINE_INT_EN_V << LCD_CAM_CAM_LINE_INT_EN_S)
#define LCD_CAM_CAM_LINE_INT_EN_V  0x00000001U
#define LCD_CAM_CAM_LINE_INT_EN_S  7
/** LCD_CAM_CAM_VS_EOF_EN : R/W; bitpos: [8]; default: 0;
 *  1: Enable CAM_VSYNC to generate in_suc_eof. 0: in_suc_eof is controlled by
 *  LCD_CAM_CAM_REC_DATA_BYTELEN.
 */
#define LCD_CAM_CAM_VS_EOF_EN    (BIT(8))
#define LCD_CAM_CAM_VS_EOF_EN_M  (LCD_CAM_CAM_VS_EOF_EN_V << LCD_CAM_CAM_VS_EOF_EN_S)
#define LCD_CAM_CAM_VS_EOF_EN_V  0x00000001U
#define LCD_CAM_CAM_VS_EOF_EN_S  8
/** LCD_CAM_CAM_CLKM_DIV_NUM : R/W; bitpos: [16:9]; default: 0;
 *  Integral camera clock divider value.
 */
#define LCD_CAM_CAM_CLKM_DIV_NUM    0x000000FFU
#define LCD_CAM_CAM_CLKM_DIV_NUM_M  (LCD_CAM_CAM_CLKM_DIV_NUM_V << LCD_CAM_CAM_CLKM_DIV_NUM_S)
#define LCD_CAM_CAM_CLKM_DIV_NUM_V  0x000000FFU
#define LCD_CAM_CAM_CLKM_DIV_NUM_S  9
/** LCD_CAM_CAM_CLKM_DIV_B : R/W; bitpos: [22:17]; default: 0;
 *  Fractional clock divider numerator value.
 */
#define LCD_CAM_CAM_CLKM_DIV_B    0x0000003FU
#define LCD_CAM_CAM_CLKM_DIV_B_M  (LCD_CAM_CAM_CLKM_DIV_B_V << LCD_CAM_CAM_CLKM_DIV_B_S)
#define LCD_CAM_CAM_CLKM_DIV_B_V  0x0000003FU
#define LCD_CAM_CAM_CLKM_DIV_B_S  17
/** LCD_CAM_CAM_CLKM_DIV_A : R/W; bitpos: [28:23]; default: 0;
 *  Fractional clock divider denominator value.
 */
#define LCD_CAM_CAM_CLKM_DIV_A    0x0000003FU
#define LCD_CAM_CAM_CLKM_DIV_A_M  (LCD_CAM_CAM_CLKM_DIV_A_V << LCD_CAM_CAM_CLKM_DIV_A_S)
#define LCD_CAM_CAM_CLKM_DIV_A_V  0x0000003FU
#define LCD_CAM_CAM_CLKM_DIV_A_S  23
/** LCD_CAM_CAM_CLK_SEL : R/W; bitpos: [30:29]; default: 0;
 *  Select camera module source clock. 0: Clock source is disabled. 1: XTAL_CLK. 2:
 *  PLL_D2_CLK. 3: PLL_F160M_CLK.
 */
#define LCD_CAM_CAM_CLK_SEL    0x00000003U
#define LCD_CAM_CAM_CLK_SEL_M  (LCD_CAM_CAM_CLK_SEL_V << LCD_CAM_CAM_CLK_SEL_S)
#define LCD_CAM_CAM_CLK_SEL_V  0x00000003U
#define LCD_CAM_CAM_CLK_SEL_S  29

/** LCD_CAM_CAM_CTRL1_REG register
 *  Camera control register
 */
#define LCD_CAM_CAM_CTRL1_REG (DR_REG_LCD_CAM_BASE + 0x8)
/** LCD_CAM_CAM_REC_DATA_BYTELEN : R/W; bitpos: [15:0]; default: 0;
 *  Configure camera received data byte length. When the length of received data
 *  reaches this value + 1, GDMA in_suc_eof_int is triggered.
 */
#define LCD_CAM_CAM_REC_DATA_BYTELEN    0x0000FFFFU
#define LCD_CAM_CAM_REC_DATA_BYTELEN_M  (LCD_CAM_CAM_REC_DATA_BYTELEN_V << LCD_CAM_CAM_REC_DATA_BYTELEN_S)
#define LCD_CAM_CAM_REC_DATA_BYTELEN_V  0x0000FFFFU
#define LCD_CAM_CAM_REC_DATA_BYTELEN_S  0
/** LCD_CAM_CAM_LINE_INT_NUM : R/W; bitpos: [21:16]; default: 0;
 *  Configure line number. When the number of received lines reaches this value + 1,
 *  LCD_CAM_CAM_HS_INT is triggered.
 */
#define LCD_CAM_CAM_LINE_INT_NUM    0x0000003FU
#define LCD_CAM_CAM_LINE_INT_NUM_M  (LCD_CAM_CAM_LINE_INT_NUM_V << LCD_CAM_CAM_LINE_INT_NUM_S)
#define LCD_CAM_CAM_LINE_INT_NUM_V  0x0000003FU
#define LCD_CAM_CAM_LINE_INT_NUM_S  16
/** LCD_CAM_CAM_CLK_INV : R/W; bitpos: [22]; default: 0;
 *  1: Invert the input signal CAM_PCLK. 0: Do not invert.
 */
#define LCD_CAM_CAM_CLK_INV    (BIT(22))
#define LCD_CAM_CAM_CLK_INV_M  (LCD_CAM_CAM_CLK_INV_V << LCD_CAM_CAM_CLK_INV_S)
#define LCD_CAM_CAM_CLK_INV_V  0x00000001U
#define LCD_CAM_CAM_CLK_INV_S  22
/** LCD_CAM_CAM_VSYNC_FILTER_EN : R/W; bitpos: [23]; default: 0;
 *  1: Enable CAM_VSYNC filter function. 0: Bypass.
 */
#define LCD_CAM_CAM_VSYNC_FILTER_EN    (BIT(23))
#define LCD_CAM_CAM_VSYNC_FILTER_EN_M  (LCD_CAM_CAM_VSYNC_FILTER_EN_V << LCD_CAM_CAM_VSYNC_FILTER_EN_S)
#define LCD_CAM_CAM_VSYNC_FILTER_EN_V  0x00000001U
#define LCD_CAM_CAM_VSYNC_FILTER_EN_S  23
/** LCD_CAM_CAM_2BYTE_EN : R/W; bitpos: [24]; default: 0;
 *  1: The width of input data is 16 bits. 0: The width of input data is 8 bits.
 */
#define LCD_CAM_CAM_2BYTE_EN    (BIT(24))
#define LCD_CAM_CAM_2BYTE_EN_M  (LCD_CAM_CAM_2BYTE_EN_V << LCD_CAM_CAM_2BYTE_EN_S)
#define LCD_CAM_CAM_2BYTE_EN_V  0x00000001U
#define LCD_CAM_CAM_2BYTE_EN_S  24
/** LCD_CAM_CAM_DE_INV : R/W; bitpos: [25]; default: 0;
 *  CAM_DE invert enable signal, valid in high level.
 */
#define LCD_CAM_CAM_DE_INV    (BIT(25))
#define LCD_CAM_CAM_DE_INV_M  (LCD_CAM_CAM_DE_INV_V << LCD_CAM_CAM_DE_INV_S)
#define LCD_CAM_CAM_DE_INV_V  0x00000001U
#define LCD_CAM_CAM_DE_INV_S  25
/** LCD_CAM_CAM_HSYNC_INV : R/W; bitpos: [26]; default: 0;
 *  CAM_HSYNC invert enable signal, valid in high level.
 */
#define LCD_CAM_CAM_HSYNC_INV    (BIT(26))
#define LCD_CAM_CAM_HSYNC_INV_M  (LCD_CAM_CAM_HSYNC_INV_V << LCD_CAM_CAM_HSYNC_INV_S)
#define LCD_CAM_CAM_HSYNC_INV_V  0x00000001U
#define LCD_CAM_CAM_HSYNC_INV_S  26
/** LCD_CAM_CAM_VSYNC_INV : R/W; bitpos: [27]; default: 0;
 *  CAM_VSYNC invert enable signal, valid in high level.
 */
#define LCD_CAM_CAM_VSYNC_INV    (BIT(27))
#define LCD_CAM_CAM_VSYNC_INV_M  (LCD_CAM_CAM_VSYNC_INV_V << LCD_CAM_CAM_VSYNC_INV_S)
#define LCD_CAM_CAM_VSYNC_INV_V  0x00000001U
#define LCD_CAM_CAM_VSYNC_INV_S  27
/** LCD_CAM_CAM_VH_DE_MODE_EN : R/W; bitpos: [28]; default: 0;
 *  1: Input control signals are CAM_DE and CAM_HSYNC. CAM_VSYNC is 1. 0: Input control
 *  signals are CAM_DE and CAM_VSYNC. CAM_HSYNC and CAM_DE are all 1 at the the same
 *  time.
 */
#define LCD_CAM_CAM_VH_DE_MODE_EN    (BIT(28))
#define LCD_CAM_CAM_VH_DE_MODE_EN_M  (LCD_CAM_CAM_VH_DE_MODE_EN_V << LCD_CAM_CAM_VH_DE_MODE_EN_S)
#define LCD_CAM_CAM_VH_DE_MODE_EN_V  0x00000001U
#define LCD_CAM_CAM_VH_DE_MODE_EN_S  28
/** LCD_CAM_CAM_START : R/W; bitpos: [29]; default: 0;
 *  Camera module start signal.
 */
#define LCD_CAM_CAM_START    (BIT(29))
#define LCD_CAM_CAM_START_M  (LCD_CAM_CAM_START_V << LCD_CAM_CAM_START_S)
#define LCD_CAM_CAM_START_V  0x00000001U
#define LCD_CAM_CAM_START_S  29
/** LCD_CAM_CAM_RESET : WO; bitpos: [30]; default: 0;
 *  Camera module reset signal.
 */
#define LCD_CAM_CAM_RESET    (BIT(30))
#define LCD_CAM_CAM_RESET_M  (LCD_CAM_CAM_RESET_V << LCD_CAM_CAM_RESET_S)
#define LCD_CAM_CAM_RESET_V  0x00000001U
#define LCD_CAM_CAM_RESET_S  30
/** LCD_CAM_CAM_AFIFO_RESET : WO; bitpos: [31]; default: 0;
 *  Camera Async Rx FIFO reset signal.
 */
#define LCD_CAM_CAM_AFIFO_RESET    (BIT(31))
#define LCD_CAM_CAM_AFIFO_RESET_M  (LCD_CAM_CAM_AFIFO_RESET_V << LCD_CAM_CAM_AFIFO_RESET_S)
#define LCD_CAM_CAM_AFIFO_RESET_V  0x00000001U
#define LCD_CAM_CAM_AFIFO_RESET_S  31

/** LCD_CAM_CAM_RGB_YUV_REG register
 *  Camera data format conversion register
 */
#define LCD_CAM_CAM_RGB_YUV_REG (DR_REG_LCD_CAM_BASE + 0xc)
/** LCD_CAM_CAM_CONV_8BITS_DATA_INV : R/W; bitpos: [21]; default: 0;
 *  Swap every two 8-bit input data. 1: Enabled. 0: Disabled.
 */
#define LCD_CAM_CAM_CONV_8BITS_DATA_INV    (BIT(21))
#define LCD_CAM_CAM_CONV_8BITS_DATA_INV_M  (LCD_CAM_CAM_CONV_8BITS_DATA_INV_V << LCD_CAM_CAM_CONV_8BITS_DATA_INV_S)
#define LCD_CAM_CAM_CONV_8BITS_DATA_INV_V  0x00000001U
#define LCD_CAM_CAM_CONV_8BITS_DATA_INV_S  21
/** LCD_CAM_CAM_CONV_YUV2YUV_MODE : R/W; bitpos: [23:22]; default: 0;
 *  In YUV-to-YUV mode, 0: data is converted to YUV422 format. 1: data is converted to
 *  YUV420 format. 2: data is converted to YUV411 format. 3: disabled. To enable
 *  YUV-to-YUV mode, LCD_CAM_CAM_CONV_TRANS_MODE must be set to 1.
 */
#define LCD_CAM_CAM_CONV_YUV2YUV_MODE    0x00000003U
#define LCD_CAM_CAM_CONV_YUV2YUV_MODE_M  (LCD_CAM_CAM_CONV_YUV2YUV_MODE_V << LCD_CAM_CAM_CONV_YUV2YUV_MODE_S)
#define LCD_CAM_CAM_CONV_YUV2YUV_MODE_V  0x00000003U
#define LCD_CAM_CAM_CONV_YUV2YUV_MODE_S  22
/** LCD_CAM_CAM_CONV_YUV_MODE : R/W; bitpos: [25:24]; default: 0;
 *  In YUV-to-YUV mode and YUV-to-RGB mode, LCD_CAM_CAM_CONV_YUV_MODE decides the YUV
 *  mode of input data. 0: input data is in YUV422 format. 1: input data is in YUV420
 *  format. 2: input data is in YUV411 format. In RGB-to-YUV mode, 0: data is converted
 *  to YUV422 format. 1: data is converted to YUV420 format. 2: data is converted to
 *  YUV411 format.
 */
#define LCD_CAM_CAM_CONV_YUV_MODE    0x00000003U
#define LCD_CAM_CAM_CONV_YUV_MODE_M  (LCD_CAM_CAM_CONV_YUV_MODE_V << LCD_CAM_CAM_CONV_YUV_MODE_S)
#define LCD_CAM_CAM_CONV_YUV_MODE_V  0x00000003U
#define LCD_CAM_CAM_CONV_YUV_MODE_S  24
/** LCD_CAM_CAM_CONV_PROTOCOL_MODE : R/W; bitpos: [26]; default: 0;
 *  0: BT601. 1: BT709.
 */
#define LCD_CAM_CAM_CONV_PROTOCOL_MODE    (BIT(26))
#define LCD_CAM_CAM_CONV_PROTOCOL_MODE_M  (LCD_CAM_CAM_CONV_PROTOCOL_MODE_V << LCD_CAM_CAM_CONV_PROTOCOL_MODE_S)
#define LCD_CAM_CAM_CONV_PROTOCOL_MODE_V  0x00000001U
#define LCD_CAM_CAM_CONV_PROTOCOL_MODE_S  26
/** LCD_CAM_CAM_CONV_DATA_OUT_MODE : R/W; bitpos: [27]; default: 0;
 *  Configure color range for output data. 0: limited color range. 1: full color range.
 */
#define LCD_CAM_CAM_CONV_DATA_OUT_MODE    (BIT(27))
#define LCD_CAM_CAM_CONV_DATA_OUT_MODE_M  (LCD_CAM_CAM_CONV_DATA_OUT_MODE_V << LCD_CAM_CAM_CONV_DATA_OUT_MODE_S)
#define LCD_CAM_CAM_CONV_DATA_OUT_MODE_V  0x00000001U
#define LCD_CAM_CAM_CONV_DATA_OUT_MODE_S  27
/** LCD_CAM_CAM_CONV_DATA_IN_MODE : R/W; bitpos: [28]; default: 0;
 *  Configure color range for input data. 0: limited color range. 1: full color range.
 */
#define LCD_CAM_CAM_CONV_DATA_IN_MODE    (BIT(28))
#define LCD_CAM_CAM_CONV_DATA_IN_MODE_M  (LCD_CAM_CAM_CONV_DATA_IN_MODE_V << LCD_CAM_CAM_CONV_DATA_IN_MODE_S)
#define LCD_CAM_CAM_CONV_DATA_IN_MODE_V  0x00000001U
#define LCD_CAM_CAM_CONV_DATA_IN_MODE_S  28
/** LCD_CAM_CAM_CONV_MODE_8BITS_ON : R/W; bitpos: [29]; default: 0;
 *  0: 16-bit mode. 1: 8-bit mode.
 */
#define LCD_CAM_CAM_CONV_MODE_8BITS_ON    (BIT(29))
#define LCD_CAM_CAM_CONV_MODE_8BITS_ON_M  (LCD_CAM_CAM_CONV_MODE_8BITS_ON_V << LCD_CAM_CAM_CONV_MODE_8BITS_ON_S)
#define LCD_CAM_CAM_CONV_MODE_8BITS_ON_V  0x00000001U
#define LCD_CAM_CAM_CONV_MODE_8BITS_ON_S  29
/** LCD_CAM_CAM_CONV_TRANS_MODE : R/W; bitpos: [30]; default: 0;
 *  0: converted to RGB format. 1: converted to YUV format.
 */
#define LCD_CAM_CAM_CONV_TRANS_MODE    (BIT(30))
#define LCD_CAM_CAM_CONV_TRANS_MODE_M  (LCD_CAM_CAM_CONV_TRANS_MODE_V << LCD_CAM_CAM_CONV_TRANS_MODE_S)
#define LCD_CAM_CAM_CONV_TRANS_MODE_V  0x00000001U
#define LCD_CAM_CAM_CONV_TRANS_MODE_S  30
/** LCD_CAM_CAM_CONV_BYPASS : R/W; bitpos: [31]; default: 0;
 *  0: Bypass converter. 1: Enable converter.
 */
#define LCD_CAM_CAM_CONV_BYPASS    (BIT(31))
#define LCD_CAM_CAM_CONV_BYPASS_M  (LCD_CAM_CAM_CONV_BYPASS_V << LCD_CAM_CAM_CONV_BYPASS_S)
#define LCD_CAM_CAM_CONV_BYPASS_V  0x00000001U
#define LCD_CAM_CAM_CONV_BYPASS_S  31

/** LCD_CAM_LCD_RGB_YUV_REG register
 *  LCD data format conversion register
 */
#define LCD_CAM_LCD_RGB_YUV_REG (DR_REG_LCD_CAM_BASE + 0x10)
/** LCD_CAM_LCD_CONV_8BITS_DATA_INV : R/W; bitpos: [20]; default: 0;
 *  Swap every two 8-bit input data. 1: Enabled. 0: Disabled.
 */
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV    (BIT(20))
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV_M  (LCD_CAM_LCD_CONV_8BITS_DATA_INV_V << LCD_CAM_LCD_CONV_8BITS_DATA_INV_S)
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV_V  0x00000001U
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV_S  20
/** LCD_CAM_LCD_CONV_TXTORX : R/W; bitpos: [21]; default: 0;
 *  0: txtorx mode off. 1: txtorx mode on.
 */
#define LCD_CAM_LCD_CONV_TXTORX    (BIT(21))
#define LCD_CAM_LCD_CONV_TXTORX_M  (LCD_CAM_LCD_CONV_TXTORX_V << LCD_CAM_LCD_CONV_TXTORX_S)
#define LCD_CAM_LCD_CONV_TXTORX_V  0x00000001U
#define LCD_CAM_LCD_CONV_TXTORX_S  21
/** LCD_CAM_LCD_CONV_YUV2YUV_MODE : R/W; bitpos: [23:22]; default: 0;
 *  In YUV-to-YUV mode, 0: data is converted to YUV422 format. 1: data is converted to
 *  YUV420 format. 2: data is converted to YUV411 format. 3: disabled. To enable
 *  YUV-to-YUV mode, LCD_CAM_LCD_CONV_TRANS_MODE must be set to 1.
 */
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE    0x00000003U
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE_M  (LCD_CAM_LCD_CONV_YUV2YUV_MODE_V << LCD_CAM_LCD_CONV_YUV2YUV_MODE_S)
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE_V  0x00000003U
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE_S  22
/** LCD_CAM_LCD_CONV_YUV_MODE : R/W; bitpos: [25:24]; default: 0;
 *  In YUV-to-YUV mode and YUV-to-RGB mode, LCD_CAM_LCD_CONV_YUV_MODE decides the YUV
 *  mode of input data. 0: input data is in YUV422 format. 1: input data is in YUV420
 *  format. 2: input data is in YUV411 format. In RGB-to-YUV mode, 0: data is converted
 *  to YUV422 format. 1: data is converted to YUV420 format. 2: data is converted to
 *  YUV411 format.
 */
#define LCD_CAM_LCD_CONV_YUV_MODE    0x00000003U
#define LCD_CAM_LCD_CONV_YUV_MODE_M  (LCD_CAM_LCD_CONV_YUV_MODE_V << LCD_CAM_LCD_CONV_YUV_MODE_S)
#define LCD_CAM_LCD_CONV_YUV_MODE_V  0x00000003U
#define LCD_CAM_LCD_CONV_YUV_MODE_S  24
/** LCD_CAM_LCD_CONV_PROTOCOL_MODE : R/W; bitpos: [26]; default: 0;
 *  0: BT601. 1: BT709.
 */
#define LCD_CAM_LCD_CONV_PROTOCOL_MODE    (BIT(26))
#define LCD_CAM_LCD_CONV_PROTOCOL_MODE_M  (LCD_CAM_LCD_CONV_PROTOCOL_MODE_V << LCD_CAM_LCD_CONV_PROTOCOL_MODE_S)
#define LCD_CAM_LCD_CONV_PROTOCOL_MODE_V  0x00000001U
#define LCD_CAM_LCD_CONV_PROTOCOL_MODE_S  26
/** LCD_CAM_LCD_CONV_DATA_OUT_MODE : R/W; bitpos: [27]; default: 0;
 *  Configure color range for output data. 0: limited color range. 1: full color range.
 */
#define LCD_CAM_LCD_CONV_DATA_OUT_MODE    (BIT(27))
#define LCD_CAM_LCD_CONV_DATA_OUT_MODE_M  (LCD_CAM_LCD_CONV_DATA_OUT_MODE_V << LCD_CAM_LCD_CONV_DATA_OUT_MODE_S)
#define LCD_CAM_LCD_CONV_DATA_OUT_MODE_V  0x00000001U
#define LCD_CAM_LCD_CONV_DATA_OUT_MODE_S  27
/** LCD_CAM_LCD_CONV_DATA_IN_MODE : R/W; bitpos: [28]; default: 0;
 *  Configure color range for input data. 0: limited color range. 1: full color range.
 */
#define LCD_CAM_LCD_CONV_DATA_IN_MODE    (BIT(28))
#define LCD_CAM_LCD_CONV_DATA_IN_MODE_M  (LCD_CAM_LCD_CONV_DATA_IN_MODE_V << LCD_CAM_LCD_CONV_DATA_IN_MODE_S)
#define LCD_CAM_LCD_CONV_DATA_IN_MODE_V  0x00000001U
#define LCD_CAM_LCD_CONV_DATA_IN_MODE_S  28
/** LCD_CAM_LCD_CONV_MODE_8BITS_ON : R/W; bitpos: [29]; default: 0;
 *  0: 16-bit mode. 1: 8-bit mode.
 */
#define LCD_CAM_LCD_CONV_MODE_8BITS_ON    (BIT(29))
#define LCD_CAM_LCD_CONV_MODE_8BITS_ON_M  (LCD_CAM_LCD_CONV_MODE_8BITS_ON_V << LCD_CAM_LCD_CONV_MODE_8BITS_ON_S)
#define LCD_CAM_LCD_CONV_MODE_8BITS_ON_V  0x00000001U
#define LCD_CAM_LCD_CONV_MODE_8BITS_ON_S  29
/** LCD_CAM_LCD_CONV_TRANS_MODE : R/W; bitpos: [30]; default: 0;
 *  0: converted to RGB format. 1: converted to YUV format.
 */
#define LCD_CAM_LCD_CONV_TRANS_MODE    (BIT(30))
#define LCD_CAM_LCD_CONV_TRANS_MODE_M  (LCD_CAM_LCD_CONV_TRANS_MODE_V << LCD_CAM_LCD_CONV_TRANS_MODE_S)
#define LCD_CAM_LCD_CONV_TRANS_MODE_V  0x00000001U
#define LCD_CAM_LCD_CONV_TRANS_MODE_S  30
/** LCD_CAM_LCD_CONV_BYPASS : R/W; bitpos: [31]; default: 0;
 *  0: Bypass converter. 1: Enable converter.
 */
#define LCD_CAM_LCD_CONV_BYPASS    (BIT(31))
#define LCD_CAM_LCD_CONV_BYPASS_M  (LCD_CAM_LCD_CONV_BYPASS_V << LCD_CAM_LCD_CONV_BYPASS_S)
#define LCD_CAM_LCD_CONV_BYPASS_V  0x00000001U
#define LCD_CAM_LCD_CONV_BYPASS_S  31

