espressif/esp-idf/components/soc/esp32s3/register/soc/lcd_cam_reg.h
/** LCD_CAM_LCD_USER_REG register
 *  LCD user configuration register
 */
#define LCD_CAM_LCD_USER_REG (DR_REG_LCD_CAM_BASE + 0x14)
/** LCD_CAM_LCD_DOUT_CYCLELEN : R/W; bitpos: [12:0]; default: 0;
 *  Configure the cycles for DOUT phase of LCD module. The cycles =  this value + 1.
 */
#define LCD_CAM_LCD_DOUT_CYCLELEN    0x00001FFFU
#define LCD_CAM_LCD_DOUT_CYCLELEN_M  (LCD_CAM_LCD_DOUT_CYCLELEN_V << LCD_CAM_LCD_DOUT_CYCLELEN_S)
#define LCD_CAM_LCD_DOUT_CYCLELEN_V  0x00001FFFU
#define LCD_CAM_LCD_DOUT_CYCLELEN_S  0
/** LCD_CAM_LCD_ALWAYS_OUT_EN : R/W; bitpos: [13]; default: 0;
 *  LCD continues outputting data when LCD is in DOUT phase, till LCD_CAM_LCD_START is
 *  cleared or LCD_CAM_LCD_RESET is set.
 */
#define LCD_CAM_LCD_ALWAYS_OUT_EN    (BIT(13))
#define LCD_CAM_LCD_ALWAYS_OUT_EN_M  (LCD_CAM_LCD_ALWAYS_OUT_EN_V << LCD_CAM_LCD_ALWAYS_OUT_EN_S)
#define LCD_CAM_LCD_ALWAYS_OUT_EN_V  0x00000001U
#define LCD_CAM_LCD_ALWAYS_OUT_EN_S  13
/** LCD_CAM_LCD_8BITS_ORDER : R/W; bitpos: [19]; default: 0;
 *  1: Swap every two data bytes, valid in 8-bit mode. 0: Do not swap.
 */
#define LCD_CAM_LCD_8BITS_ORDER    (BIT(19))
#define LCD_CAM_LCD_8BITS_ORDER_M  (LCD_CAM_LCD_8BITS_ORDER_V << LCD_CAM_LCD_8BITS_ORDER_S)
#define LCD_CAM_LCD_8BITS_ORDER_V  0x00000001U
#define LCD_CAM_LCD_8BITS_ORDER_S  19
/** LCD_CAM_LCD_UPDATE : R/W; bitpos: [20]; default: 0;
 *  1: Update LCD registers. This bit is cleared by hardware. 0: Do not care.
 */
#define LCD_CAM_LCD_UPDATE    (BIT(20))
#define LCD_CAM_LCD_UPDATE_M  (LCD_CAM_LCD_UPDATE_V << LCD_CAM_LCD_UPDATE_S)
#define LCD_CAM_LCD_UPDATE_V  0x00000001U
#define LCD_CAM_LCD_UPDATE_S  20
/** LCD_CAM_LCD_BIT_ORDER : R/W; bitpos: [21]; default: 0;
 *  1: Change data bit order. Change LCD_DATA_out[7:0] to LCD_DATA_out[0:7] in 8-bit
 *  mode, and bits[15:0] to bits[0:15] in 16-bit mode. 0: Do not change.
 */
#define LCD_CAM_LCD_BIT_ORDER    (BIT(21))
#define LCD_CAM_LCD_BIT_ORDER_M  (LCD_CAM_LCD_BIT_ORDER_V << LCD_CAM_LCD_BIT_ORDER_S)
#define LCD_CAM_LCD_BIT_ORDER_V  0x00000001U
#define LCD_CAM_LCD_BIT_ORDER_S  21
/** LCD_CAM_LCD_BYTE_ORDER : R/W; bitpos: [22]; default: 0;
 *  1: Invert data byte order, only valid in 16-bit mode. 0: Do not invert.
 */
#define LCD_CAM_LCD_BYTE_ORDER    (BIT(22))
#define LCD_CAM_LCD_BYTE_ORDER_M  (LCD_CAM_LCD_BYTE_ORDER_V << LCD_CAM_LCD_BYTE_ORDER_S)
#define LCD_CAM_LCD_BYTE_ORDER_V  0x00000001U
#define LCD_CAM_LCD_BYTE_ORDER_S  22
/** LCD_CAM_LCD_2BYTE_EN : R/W; bitpos: [23]; default: 0;
 *  1: The width of output LCD data is 16 bits. 0: The width of output LCD data is 8
 *  bits.
 */
#define LCD_CAM_LCD_2BYTE_EN    (BIT(23))
#define LCD_CAM_LCD_2BYTE_EN_M  (LCD_CAM_LCD_2BYTE_EN_V << LCD_CAM_LCD_2BYTE_EN_S)
#define LCD_CAM_LCD_2BYTE_EN_V  0x00000001U
#define LCD_CAM_LCD_2BYTE_EN_S  23
/** LCD_CAM_LCD_DOUT : R/W; bitpos: [24]; default: 0;
 *  1: Be able to send data out in LCD sequence when LCD starts. 0: Disable.
 */
#define LCD_CAM_LCD_DOUT    (BIT(24))
#define LCD_CAM_LCD_DOUT_M  (LCD_CAM_LCD_DOUT_V << LCD_CAM_LCD_DOUT_S)
#define LCD_CAM_LCD_DOUT_V  0x00000001U
#define LCD_CAM_LCD_DOUT_S  24
/** LCD_CAM_LCD_DUMMY : R/W; bitpos: [25]; default: 0;
 *  1: Enable DUMMY phase in LCD sequence when LCD starts. 0: Disable.
 */
#define LCD_CAM_LCD_DUMMY    (BIT(25))
#define LCD_CAM_LCD_DUMMY_M  (LCD_CAM_LCD_DUMMY_V << LCD_CAM_LCD_DUMMY_S)
#define LCD_CAM_LCD_DUMMY_V  0x00000001U
#define LCD_CAM_LCD_DUMMY_S  25
/** LCD_CAM_LCD_CMD : R/W; bitpos: [26]; default: 0;
 *  1: Be able to send command in LCD sequence when LCD starts. 0: Disable.
 */
#define LCD_CAM_LCD_CMD    (BIT(26))
#define LCD_CAM_LCD_CMD_M  (LCD_CAM_LCD_CMD_V << LCD_CAM_LCD_CMD_S)
#define LCD_CAM_LCD_CMD_V  0x00000001U
#define LCD_CAM_LCD_CMD_S  26
/** LCD_CAM_LCD_START : R/W; bitpos: [27]; default: 0;
 *  LCD starts sending data enable signal, valid in high level.
 */
#define LCD_CAM_LCD_START    (BIT(27))
#define LCD_CAM_LCD_START_M  (LCD_CAM_LCD_START_V << LCD_CAM_LCD_START_S)
#define LCD_CAM_LCD_START_V  0x00000001U
#define LCD_CAM_LCD_START_S  27
/** LCD_CAM_LCD_RESET : WO; bitpos: [28]; default: 0;
 *  Reset LCD module.
 */
#define LCD_CAM_LCD_RESET    (BIT(28))
#define LCD_CAM_LCD_RESET_M  (LCD_CAM_LCD_RESET_V << LCD_CAM_LCD_RESET_S)
#define LCD_CAM_LCD_RESET_V  0x00000001U
#define LCD_CAM_LCD_RESET_S  28
/** LCD_CAM_LCD_DUMMY_CYCLELEN : R/W; bitpos: [30:29]; default: 0;
 *  Configure DUMMY cycles. DUMMY cycles = this value + 1.
 */
#define LCD_CAM_LCD_DUMMY_CYCLELEN    0x00000003U
#define LCD_CAM_LCD_DUMMY_CYCLELEN_M  (LCD_CAM_LCD_DUMMY_CYCLELEN_V << LCD_CAM_LCD_DUMMY_CYCLELEN_S)
#define LCD_CAM_LCD_DUMMY_CYCLELEN_V  0x00000003U
#define LCD_CAM_LCD_DUMMY_CYCLELEN_S  29
/** LCD_CAM_LCD_CMD_2_CYCLE_EN : R/W; bitpos: [31]; default: 0;
 *  The cycle length of command phase. 1: 2 cycles. 0: 1 cycle.
 */
#define LCD_CAM_LCD_CMD_2_CYCLE_EN    (BIT(31))
#define LCD_CAM_LCD_CMD_2_CYCLE_EN_M  (LCD_CAM_LCD_CMD_2_CYCLE_EN_V << LCD_CAM_LCD_CMD_2_CYCLE_EN_S)
#define LCD_CAM_LCD_CMD_2_CYCLE_EN_V  0x00000001U
#define LCD_CAM_LCD_CMD_2_CYCLE_EN_S  31

/** LCD_CAM_LCD_MISC_REG register
 *  LCD MISC configuration register
 */
#define LCD_CAM_LCD_MISC_REG (DR_REG_LCD_CAM_BASE + 0x18)
/** LCD_CAM_LCD_AFIFO_THRESHOLD_NUM : R/W; bitpos: [5:1]; default: 17;
 *  Set the threshold for Async Tx FIFO full event.
 */
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM    0x0000001FU
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_M  (LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_V << LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_S)
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_V  0x0000001FU
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_S  1
/** LCD_CAM_LCD_VFK_CYCLELEN : R/W; bitpos: [11:6]; default: 0;
 *  Configure the setup cycles in LCD non-RGB mode. Setup cycles expected = this value
 *  + 1.
 */
#define LCD_CAM_LCD_VFK_CYCLELEN    0x0000003FU
#define LCD_CAM_LCD_VFK_CYCLELEN_M  (LCD_CAM_LCD_VFK_CYCLELEN_V << LCD_CAM_LCD_VFK_CYCLELEN_S)
#define LCD_CAM_LCD_VFK_CYCLELEN_V  0x0000003FU
#define LCD_CAM_LCD_VFK_CYCLELEN_S  6
/** LCD_CAM_LCD_VBK_CYCLELEN : R/W; bitpos: [24:12]; default: 0;
 *  Configure the hold time cycles in LCD non-RGB mode. Hold cycles expected = this
 *  value + 1. %Configure the cycles for vertical back blank region in LCD RGB mode,
 *  the cycles = this value + 1. Or configure the hold time cycles in LCD non-RGB mode,
 *  the cycles = this value + 1.
 */
#define LCD_CAM_LCD_VBK_CYCLELEN    0x00001FFFU
#define LCD_CAM_LCD_VBK_CYCLELEN_M  (LCD_CAM_LCD_VBK_CYCLELEN_V << LCD_CAM_LCD_VBK_CYCLELEN_S)
#define LCD_CAM_LCD_VBK_CYCLELEN_V  0x00001FFFU
#define LCD_CAM_LCD_VBK_CYCLELEN_S  12
/** LCD_CAM_LCD_NEXT_FRAME_EN : R/W; bitpos: [25]; default: 0;
 *  1: Send the next frame data when the current frame is sent out. 0: LCD stops when
 *  the current frame is sent out.
 */
#define LCD_CAM_LCD_NEXT_FRAME_EN    (BIT(25))
#define LCD_CAM_LCD_NEXT_FRAME_EN_M  (LCD_CAM_LCD_NEXT_FRAME_EN_V << LCD_CAM_LCD_NEXT_FRAME_EN_S)
#define LCD_CAM_LCD_NEXT_FRAME_EN_V  0x00000001U
#define LCD_CAM_LCD_NEXT_FRAME_EN_S  25
/** LCD_CAM_LCD_BK_EN : R/W; bitpos: [26]; default: 0;
 *  1: Enable blank region when LCD sends data out. 0: No blank region.
 */
#define LCD_CAM_LCD_BK_EN    (BIT(26))
#define LCD_CAM_LCD_BK_EN_M  (LCD_CAM_LCD_BK_EN_V << LCD_CAM_LCD_BK_EN_S)
#define LCD_CAM_LCD_BK_EN_V  0x00000001U
#define LCD_CAM_LCD_BK_EN_S  26
/** LCD_CAM_LCD_AFIFO_RESET : WO; bitpos: [27]; default: 0;
 *  Async Tx FIFO reset signal.
 */
#define LCD_CAM_LCD_AFIFO_RESET    (BIT(27))
#define LCD_CAM_LCD_AFIFO_RESET_M  (LCD_CAM_LCD_AFIFO_RESET_V << LCD_CAM_LCD_AFIFO_RESET_S)
#define LCD_CAM_LCD_AFIFO_RESET_V  0x00000001U
#define LCD_CAM_LCD_AFIFO_RESET_S  27
/** LCD_CAM_LCD_CD_DATA_SET : R/W; bitpos: [28]; default: 0;
 *  1: LCD_CD = !LCD_CAM_LCD_CD_IDLE_EDGE when LCD is in DOUT phase. 0: LCD_CD =
 *  LCD_CAM_LCD_CD_IDLE_EDGE.
 */
#define LCD_CAM_LCD_CD_DATA_SET    (BIT(28))
#define LCD_CAM_LCD_CD_DATA_SET_M  (LCD_CAM_LCD_CD_DATA_SET_V << LCD_CAM_LCD_CD_DATA_SET_S)
#define LCD_CAM_LCD_CD_DATA_SET_V  0x00000001U
#define LCD_CAM_LCD_CD_DATA_SET_S  28
/** LCD_CAM_LCD_CD_DUMMY_SET : R/W; bitpos: [29]; default: 0;
 *  1: LCD_CD = !LCD_CAM_LCD_CD_IDLE_EDGE when LCD is in DUMMY phase. 0: LCD_CD =
 *  LCD_CAM_LCD_CD_IDLE_EDGE.
 */
#define LCD_CAM_LCD_CD_DUMMY_SET    (BIT(29))
#define LCD_CAM_LCD_CD_DUMMY_SET_M  (LCD_CAM_LCD_CD_DUMMY_SET_V << LCD_CAM_LCD_CD_DUMMY_SET_S)
#define LCD_CAM_LCD_CD_DUMMY_SET_V  0x00000001U
#define LCD_CAM_LCD_CD_DUMMY_SET_S  29
/** LCD_CAM_LCD_CD_CMD_SET : R/W; bitpos: [30]; default: 0;
 *  1: LCD_CD = !LCD_CAM_LCD_CD_IDLE_EDGE when LCD is in CMD phase. 0: LCD_CD =
 *  LCD_CAM_LCD_CD_IDLE_EDGE.
 */
#define LCD_CAM_LCD_CD_CMD_SET    (BIT(30))
#define LCD_CAM_LCD_CD_CMD_SET_M  (LCD_CAM_LCD_CD_CMD_SET_V << LCD_CAM_LCD_CD_CMD_SET_S)
#define LCD_CAM_LCD_CD_CMD_SET_V  0x00000001U
#define LCD_CAM_LCD_CD_CMD_SET_S  30
/** LCD_CAM_LCD_CD_IDLE_EDGE : R/W; bitpos: [31]; default: 0;
 *  The default value of LCD_CD.
 */
#define LCD_CAM_LCD_CD_IDLE_EDGE    (BIT(31))
#define LCD_CAM_LCD_CD_IDLE_EDGE_M  (LCD_CAM_LCD_CD_IDLE_EDGE_V << LCD_CAM_LCD_CD_IDLE_EDGE_S)
#define LCD_CAM_LCD_CD_IDLE_EDGE_V  0x00000001U
#define LCD_CAM_LCD_CD_IDLE_EDGE_S  31

/** LCD_CAM_LCD_CTRL_REG register
 *  LCD signal configuration register
 */
#define LCD_CAM_LCD_CTRL_REG (DR_REG_LCD_CAM_BASE + 0x1c)
/** LCD_CAM_LCD_HB_FRONT : R/W; bitpos: [10:0]; default: 0;
 *  It is the horizontal blank front porch of a frame.
 */
#define LCD_CAM_LCD_HB_FRONT    0x000007FFU
#define LCD_CAM_LCD_HB_FRONT_M  (LCD_CAM_LCD_HB_FRONT_V << LCD_CAM_LCD_HB_FRONT_S)
#define LCD_CAM_LCD_HB_FRONT_V  0x000007FFU
#define LCD_CAM_LCD_HB_FRONT_S  0
/** LCD_CAM_LCD_VA_HEIGHT : R/W; bitpos: [20:11]; default: 0;
 *  It is the vertical active height of a frame.
 */
#define LCD_CAM_LCD_VA_HEIGHT    0x000003FFU
#define LCD_CAM_LCD_VA_HEIGHT_M  (LCD_CAM_LCD_VA_HEIGHT_V << LCD_CAM_LCD_VA_HEIGHT_S)
#define LCD_CAM_LCD_VA_HEIGHT_V  0x000003FFU
#define LCD_CAM_LCD_VA_HEIGHT_S  11
/** LCD_CAM_LCD_VT_HEIGHT : R/W; bitpos: [30:21]; default: 0;
 *  It is the vertical total height of a frame.
 */
#define LCD_CAM_LCD_VT_HEIGHT    0x000003FFU
#define LCD_CAM_LCD_VT_HEIGHT_M  (LCD_CAM_LCD_VT_HEIGHT_V << LCD_CAM_LCD_VT_HEIGHT_S)
#define LCD_CAM_LCD_VT_HEIGHT_V  0x000003FFU
#define LCD_CAM_LCD_VT_HEIGHT_S  21
/** LCD_CAM_LCD_RGB_MODE_EN : R/W; bitpos: [31]; default: 0;
 *  1: Enable RGB mode, and input VSYNC, HSYNC, and DE signals. 0: Disable.
 */
#define LCD_CAM_LCD_RGB_MODE_EN    (BIT(31))
#define LCD_CAM_LCD_RGB_MODE_EN_M  (LCD_CAM_LCD_RGB_MODE_EN_V << LCD_CAM_LCD_RGB_MODE_EN_S)
#define LCD_CAM_LCD_RGB_MODE_EN_V  0x00000001U
#define LCD_CAM_LCD_RGB_MODE_EN_S  31

