espressif/esp-idf/components/soc/esp32s3/register/soc/lcd_cam_reg.h
/** LCD_CAM_LCD_CTRL1_REG register
 *  LCD signal configuration register 1
 */
#define LCD_CAM_LCD_CTRL1_REG (DR_REG_LCD_CAM_BASE + 0x20)
/** LCD_CAM_LCD_VB_FRONT : R/W; bitpos: [7:0]; default: 0;
 *  It is the vertical blank front porch of a frame.
 */
#define LCD_CAM_LCD_VB_FRONT    0x000000FFU
#define LCD_CAM_LCD_VB_FRONT_M  (LCD_CAM_LCD_VB_FRONT_V << LCD_CAM_LCD_VB_FRONT_S)
#define LCD_CAM_LCD_VB_FRONT_V  0x000000FFU
#define LCD_CAM_LCD_VB_FRONT_S  0
/** LCD_CAM_LCD_HA_WIDTH : R/W; bitpos: [19:8]; default: 0;
 *  It is the horizontal active width of a frame.
 */
#define LCD_CAM_LCD_HA_WIDTH    0x00000FFFU
#define LCD_CAM_LCD_HA_WIDTH_M  (LCD_CAM_LCD_HA_WIDTH_V << LCD_CAM_LCD_HA_WIDTH_S)
#define LCD_CAM_LCD_HA_WIDTH_V  0x00000FFFU
#define LCD_CAM_LCD_HA_WIDTH_S  8
/** LCD_CAM_LCD_HT_WIDTH : R/W; bitpos: [31:20]; default: 0;
 *  It is the horizontal total width of a frame.
 */
#define LCD_CAM_LCD_HT_WIDTH    0x00000FFFU
#define LCD_CAM_LCD_HT_WIDTH_M  (LCD_CAM_LCD_HT_WIDTH_V << LCD_CAM_LCD_HT_WIDTH_S)
#define LCD_CAM_LCD_HT_WIDTH_V  0x00000FFFU
#define LCD_CAM_LCD_HT_WIDTH_S  20

/** LCD_CAM_LCD_CTRL2_REG register
 *  LCD signal configuration register 2
 */
#define LCD_CAM_LCD_CTRL2_REG (DR_REG_LCD_CAM_BASE + 0x24)
/** LCD_CAM_LCD_VSYNC_WIDTH : R/W; bitpos: [6:0]; default: 0;
 *  It is the width of LCD_VSYNC active pulse in a line.
 */
#define LCD_CAM_LCD_VSYNC_WIDTH    0x0000007FU
#define LCD_CAM_LCD_VSYNC_WIDTH_M  (LCD_CAM_LCD_VSYNC_WIDTH_V << LCD_CAM_LCD_VSYNC_WIDTH_S)
#define LCD_CAM_LCD_VSYNC_WIDTH_V  0x0000007FU
#define LCD_CAM_LCD_VSYNC_WIDTH_S  0
/** LCD_CAM_LCD_VSYNC_IDLE_POL : R/W; bitpos: [7]; default: 0;
 *  It is the idle value of LCD_VSYNC.
 */
#define LCD_CAM_LCD_VSYNC_IDLE_POL    (BIT(7))
#define LCD_CAM_LCD_VSYNC_IDLE_POL_M  (LCD_CAM_LCD_VSYNC_IDLE_POL_V << LCD_CAM_LCD_VSYNC_IDLE_POL_S)
#define LCD_CAM_LCD_VSYNC_IDLE_POL_V  0x00000001U
#define LCD_CAM_LCD_VSYNC_IDLE_POL_S  7
/** LCD_CAM_LCD_DE_IDLE_POL : R/W; bitpos: [8]; default: 0;
 *  It is the idle value of LCD_DE.
 */
#define LCD_CAM_LCD_DE_IDLE_POL    (BIT(8))
#define LCD_CAM_LCD_DE_IDLE_POL_M  (LCD_CAM_LCD_DE_IDLE_POL_V << LCD_CAM_LCD_DE_IDLE_POL_S)
#define LCD_CAM_LCD_DE_IDLE_POL_V  0x00000001U
#define LCD_CAM_LCD_DE_IDLE_POL_S  8
/** LCD_CAM_LCD_HS_BLANK_EN : R/W; bitpos: [9]; default: 0;
 *  1: The pulse of LCD_HSYNC is out in vertical blanking lines in RGB mode. 0:
 *  LCD_HSYNC pulse is valid only in active region lines in RGB mode.
 */
#define LCD_CAM_LCD_HS_BLANK_EN    (BIT(9))
#define LCD_CAM_LCD_HS_BLANK_EN_M  (LCD_CAM_LCD_HS_BLANK_EN_V << LCD_CAM_LCD_HS_BLANK_EN_S)
#define LCD_CAM_LCD_HS_BLANK_EN_V  0x00000001U
#define LCD_CAM_LCD_HS_BLANK_EN_S  9
/** LCD_CAM_LCD_HSYNC_WIDTH : R/W; bitpos: [22:16]; default: 0;
 *  It is the width of LCD_HSYNC active pulse in a line.
 */
#define LCD_CAM_LCD_HSYNC_WIDTH    0x0000007FU
#define LCD_CAM_LCD_HSYNC_WIDTH_M  (LCD_CAM_LCD_HSYNC_WIDTH_V << LCD_CAM_LCD_HSYNC_WIDTH_S)
#define LCD_CAM_LCD_HSYNC_WIDTH_V  0x0000007FU
#define LCD_CAM_LCD_HSYNC_WIDTH_S  16
/** LCD_CAM_LCD_HSYNC_IDLE_POL : R/W; bitpos: [23]; default: 0;
 *  It is the idle value of LCD_HSYNC.
 */
#define LCD_CAM_LCD_HSYNC_IDLE_POL    (BIT(23))
#define LCD_CAM_LCD_HSYNC_IDLE_POL_M  (LCD_CAM_LCD_HSYNC_IDLE_POL_V << LCD_CAM_LCD_HSYNC_IDLE_POL_S)
#define LCD_CAM_LCD_HSYNC_IDLE_POL_V  0x00000001U
#define LCD_CAM_LCD_HSYNC_IDLE_POL_S  23
/** LCD_CAM_LCD_HSYNC_POSITION : R/W; bitpos: [31:24]; default: 0;
 *  It is the position of LCD_HSYNC active pulse in a line.
 */
#define LCD_CAM_LCD_HSYNC_POSITION    0x000000FFU
#define LCD_CAM_LCD_HSYNC_POSITION_M  (LCD_CAM_LCD_HSYNC_POSITION_V << LCD_CAM_LCD_HSYNC_POSITION_S)
#define LCD_CAM_LCD_HSYNC_POSITION_V  0x000000FFU
#define LCD_CAM_LCD_HSYNC_POSITION_S  24

/** LCD_CAM_LCD_CMD_VAL_REG register
 *  LCD command value configuration register
 */
#define LCD_CAM_LCD_CMD_VAL_REG (DR_REG_LCD_CAM_BASE + 0x28)
/** LCD_CAM_LCD_CMD_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  The LCD write command value.
 */
#define LCD_CAM_LCD_CMD_VALUE    0xFFFFFFFFU
#define LCD_CAM_LCD_CMD_VALUE_M  (LCD_CAM_LCD_CMD_VALUE_V << LCD_CAM_LCD_CMD_VALUE_S)
#define LCD_CAM_LCD_CMD_VALUE_V  0xFFFFFFFFU
#define LCD_CAM_LCD_CMD_VALUE_S  0

/** LCD_CAM_LCD_DLY_MODE_REG register
 *  LCD signal delay configuration register
 */
#define LCD_CAM_LCD_DLY_MODE_REG (DR_REG_LCD_CAM_BASE + 0x30)
/** LCD_CAM_LCD_CD_MODE : R/W; bitpos: [1:0]; default: 0;
 *  The output LCD_CD is delayed by module clock LCD_CLK. 0: output without delay. 1:
 *  delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_LCD_CD_MODE    0x00000003U
#define LCD_CAM_LCD_CD_MODE_M  (LCD_CAM_LCD_CD_MODE_V << LCD_CAM_LCD_CD_MODE_S)
#define LCD_CAM_LCD_CD_MODE_V  0x00000003U
#define LCD_CAM_LCD_CD_MODE_S  0
/** LCD_CAM_LCD_DE_MODE : R/W; bitpos: [3:2]; default: 0;
 *  The output LCD_DE is delayed by module clock LCD_CLK. 0: output without delay. 1:
 *  delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_LCD_DE_MODE    0x00000003U
#define LCD_CAM_LCD_DE_MODE_M  (LCD_CAM_LCD_DE_MODE_V << LCD_CAM_LCD_DE_MODE_S)
#define LCD_CAM_LCD_DE_MODE_V  0x00000003U
#define LCD_CAM_LCD_DE_MODE_S  2
/** LCD_CAM_LCD_HSYNC_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The output LCD_HSYNC is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_LCD_HSYNC_MODE    0x00000003U
#define LCD_CAM_LCD_HSYNC_MODE_M  (LCD_CAM_LCD_HSYNC_MODE_V << LCD_CAM_LCD_HSYNC_MODE_S)
#define LCD_CAM_LCD_HSYNC_MODE_V  0x00000003U
#define LCD_CAM_LCD_HSYNC_MODE_S  4
/** LCD_CAM_LCD_VSYNC_MODE : R/W; bitpos: [7:6]; default: 0;
 *  The output LCD_VSYNC is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delay by the falling edge of LCD_CLK.
 */
#define LCD_CAM_LCD_VSYNC_MODE    0x00000003U
#define LCD_CAM_LCD_VSYNC_MODE_M  (LCD_CAM_LCD_VSYNC_MODE_V << LCD_CAM_LCD_VSYNC_MODE_S)
#define LCD_CAM_LCD_VSYNC_MODE_V  0x00000003U
#define LCD_CAM_LCD_VSYNC_MODE_S  6

/** LCD_CAM_LCD_DATA_DOUT_MODE_REG register
 *  LCD data delay configuration register
 */
#define LCD_CAM_LCD_DATA_DOUT_MODE_REG (DR_REG_LCD_CAM_BASE + 0x38)
/** LCD_CAM_DOUT0_MODE : R/W; bitpos: [1:0]; default: 0;
 *  The output data bit 0 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT0_MODE    0x00000003U
#define LCD_CAM_DOUT0_MODE_M  (LCD_CAM_DOUT0_MODE_V << LCD_CAM_DOUT0_MODE_S)
#define LCD_CAM_DOUT0_MODE_V  0x00000003U
#define LCD_CAM_DOUT0_MODE_S  0
/** LCD_CAM_DOUT1_MODE : R/W; bitpos: [3:2]; default: 0;
 *  The output data bit 1 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT1_MODE    0x00000003U
#define LCD_CAM_DOUT1_MODE_M  (LCD_CAM_DOUT1_MODE_V << LCD_CAM_DOUT1_MODE_S)
#define LCD_CAM_DOUT1_MODE_V  0x00000003U
#define LCD_CAM_DOUT1_MODE_S  2
/** LCD_CAM_DOUT2_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The output data bit 2 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT2_MODE    0x00000003U
#define LCD_CAM_DOUT2_MODE_M  (LCD_CAM_DOUT2_MODE_V << LCD_CAM_DOUT2_MODE_S)
#define LCD_CAM_DOUT2_MODE_V  0x00000003U
#define LCD_CAM_DOUT2_MODE_S  4
/** LCD_CAM_DOUT3_MODE : R/W; bitpos: [7:6]; default: 0;
 *  The output data bit 3 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT3_MODE    0x00000003U
#define LCD_CAM_DOUT3_MODE_M  (LCD_CAM_DOUT3_MODE_V << LCD_CAM_DOUT3_MODE_S)
#define LCD_CAM_DOUT3_MODE_V  0x00000003U
#define LCD_CAM_DOUT3_MODE_S  6
/** LCD_CAM_DOUT4_MODE : R/W; bitpos: [9:8]; default: 0;
 *  The output data bit 4 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT4_MODE    0x00000003U
#define LCD_CAM_DOUT4_MODE_M  (LCD_CAM_DOUT4_MODE_V << LCD_CAM_DOUT4_MODE_S)
#define LCD_CAM_DOUT4_MODE_V  0x00000003U
#define LCD_CAM_DOUT4_MODE_S  8
/** LCD_CAM_DOUT5_MODE : R/W; bitpos: [11:10]; default: 0;
 *  The output data bit 5 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT5_MODE    0x00000003U
#define LCD_CAM_DOUT5_MODE_M  (LCD_CAM_DOUT5_MODE_V << LCD_CAM_DOUT5_MODE_S)
#define LCD_CAM_DOUT5_MODE_V  0x00000003U
#define LCD_CAM_DOUT5_MODE_S  10
/** LCD_CAM_DOUT6_MODE : R/W; bitpos: [13:12]; default: 0;
 *  The output data bit 6 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT6_MODE    0x00000003U
#define LCD_CAM_DOUT6_MODE_M  (LCD_CAM_DOUT6_MODE_V << LCD_CAM_DOUT6_MODE_S)
#define LCD_CAM_DOUT6_MODE_V  0x00000003U
#define LCD_CAM_DOUT6_MODE_S  12
/** LCD_CAM_DOUT7_MODE : R/W; bitpos: [15:14]; default: 0;
 *  The output data bit 7 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT7_MODE    0x00000003U
#define LCD_CAM_DOUT7_MODE_M  (LCD_CAM_DOUT7_MODE_V << LCD_CAM_DOUT7_MODE_S)
#define LCD_CAM_DOUT7_MODE_V  0x00000003U
#define LCD_CAM_DOUT7_MODE_S  14
/** LCD_CAM_DOUT8_MODE : R/W; bitpos: [17:16]; default: 0;
 *  The output data bit 8 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT8_MODE    0x00000003U
#define LCD_CAM_DOUT8_MODE_M  (LCD_CAM_DOUT8_MODE_V << LCD_CAM_DOUT8_MODE_S)
#define LCD_CAM_DOUT8_MODE_V  0x00000003U
#define LCD_CAM_DOUT8_MODE_S  16
/** LCD_CAM_DOUT9_MODE : R/W; bitpos: [19:18]; default: 0;
 *  The output data bit 9 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT9_MODE    0x00000003U
#define LCD_CAM_DOUT9_MODE_M  (LCD_CAM_DOUT9_MODE_V << LCD_CAM_DOUT9_MODE_S)
#define LCD_CAM_DOUT9_MODE_V  0x00000003U
#define LCD_CAM_DOUT9_MODE_S  18
/** LCD_CAM_DOUT10_MODE : R/W; bitpos: [21:20]; default: 0;
 *  The output data bit 10 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT10_MODE    0x00000003U
#define LCD_CAM_DOUT10_MODE_M  (LCD_CAM_DOUT10_MODE_V << LCD_CAM_DOUT10_MODE_S)
#define LCD_CAM_DOUT10_MODE_V  0x00000003U
#define LCD_CAM_DOUT10_MODE_S  20
/** LCD_CAM_DOUT11_MODE : R/W; bitpos: [23:22]; default: 0;
 *  The output data bit 11 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT11_MODE    0x00000003U
#define LCD_CAM_DOUT11_MODE_M  (LCD_CAM_DOUT11_MODE_V << LCD_CAM_DOUT11_MODE_S)
#define LCD_CAM_DOUT11_MODE_V  0x00000003U
#define LCD_CAM_DOUT11_MODE_S  22
/** LCD_CAM_DOUT12_MODE : R/W; bitpos: [25:24]; default: 0;
 *  The output data bit 12 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT12_MODE    0x00000003U
#define LCD_CAM_DOUT12_MODE_M  (LCD_CAM_DOUT12_MODE_V << LCD_CAM_DOUT12_MODE_S)
#define LCD_CAM_DOUT12_MODE_V  0x00000003U
#define LCD_CAM_DOUT12_MODE_S  24
/** LCD_CAM_DOUT13_MODE : R/W; bitpos: [27:26]; default: 0;
 *  The output data bit 13 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT13_MODE    0x00000003U
#define LCD_CAM_DOUT13_MODE_M  (LCD_CAM_DOUT13_MODE_V << LCD_CAM_DOUT13_MODE_S)
#define LCD_CAM_DOUT13_MODE_V  0x00000003U
#define LCD_CAM_DOUT13_MODE_S  26
/** LCD_CAM_DOUT14_MODE : R/W; bitpos: [29:28]; default: 0;
 *  The output data bit 14 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT14_MODE    0x00000003U
#define LCD_CAM_DOUT14_MODE_M  (LCD_CAM_DOUT14_MODE_V << LCD_CAM_DOUT14_MODE_S)
#define LCD_CAM_DOUT14_MODE_V  0x00000003U
#define LCD_CAM_DOUT14_MODE_S  28
/** LCD_CAM_DOUT15_MODE : R/W; bitpos: [31:30]; default: 0;
 *  The output data bit 15 is delayed by module clock LCD_CLK. 0: output without delay.
 *  1: delayed by the rising edge of LCD_CLK. 2: delayed by the falling edge of LCD_CLK.
 */
#define LCD_CAM_DOUT15_MODE    0x00000003U
#define LCD_CAM_DOUT15_MODE_M  (LCD_CAM_DOUT15_MODE_V << LCD_CAM_DOUT15_MODE_S)
#define LCD_CAM_DOUT15_MODE_V  0x00000003U
#define LCD_CAM_DOUT15_MODE_S  30

