espressif/esp-idf/components/soc/esp32s3/register/soc/lcd_cam_reg.h
/** LCD_CAM_LC_DMA_INT_ENA_REG register
 *  LCD_CAM GDMA interrupt enable register
 */
#define LCD_CAM_LC_DMA_INT_ENA_REG (DR_REG_LCD_CAM_BASE + 0x64)
/** LCD_CAM_LCD_VSYNC_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The enable bit for LCD_CAM_LCD_VSYNC_INT interrupt.
 */
#define LCD_CAM_LCD_VSYNC_INT_ENA    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_ENA_M  (LCD_CAM_LCD_VSYNC_INT_ENA_V << LCD_CAM_LCD_VSYNC_INT_ENA_S)
#define LCD_CAM_LCD_VSYNC_INT_ENA_V  0x00000001U
#define LCD_CAM_LCD_VSYNC_INT_ENA_S  0
/** LCD_CAM_LCD_TRANS_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The enable bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.
 */
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA_M  (LCD_CAM_LCD_TRANS_DONE_INT_ENA_V << LCD_CAM_LCD_TRANS_DONE_INT_ENA_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA_V  0x00000001U
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA_S  1
/** LCD_CAM_CAM_VSYNC_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The enable bit for LCD_CAM_CAM_VSYNC_INT interrupt.
 */
#define LCD_CAM_CAM_VSYNC_INT_ENA    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_ENA_M  (LCD_CAM_CAM_VSYNC_INT_ENA_V << LCD_CAM_CAM_VSYNC_INT_ENA_S)
#define LCD_CAM_CAM_VSYNC_INT_ENA_V  0x00000001U
#define LCD_CAM_CAM_VSYNC_INT_ENA_S  2
/** LCD_CAM_CAM_HS_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable bit for LCD_CAM_CAM_HS_INT interrupt.
 */
#define LCD_CAM_CAM_HS_INT_ENA    (BIT(3))
#define LCD_CAM_CAM_HS_INT_ENA_M  (LCD_CAM_CAM_HS_INT_ENA_V << LCD_CAM_CAM_HS_INT_ENA_S)
#define LCD_CAM_CAM_HS_INT_ENA_V  0x00000001U
#define LCD_CAM_CAM_HS_INT_ENA_S  3

/** LCD_CAM_LC_DMA_INT_RAW_REG register
 *  LCD_CAM GDMA raw interrupt status register
 */
#define LCD_CAM_LC_DMA_INT_RAW_REG (DR_REG_LCD_CAM_BASE + 0x68)
/** LCD_CAM_LCD_VSYNC_INT_RAW : RO; bitpos: [0]; default: 0;
 *  The raw bit for LCD_CAM_LCD_VSYNC_INT interrupt.
 */
#define LCD_CAM_LCD_VSYNC_INT_RAW    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_RAW_M  (LCD_CAM_LCD_VSYNC_INT_RAW_V << LCD_CAM_LCD_VSYNC_INT_RAW_S)
#define LCD_CAM_LCD_VSYNC_INT_RAW_V  0x00000001U
#define LCD_CAM_LCD_VSYNC_INT_RAW_S  0
/** LCD_CAM_LCD_TRANS_DONE_INT_RAW : RO; bitpos: [1]; default: 0;
 *  The raw bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.
 */
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW_M  (LCD_CAM_LCD_TRANS_DONE_INT_RAW_V << LCD_CAM_LCD_TRANS_DONE_INT_RAW_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW_V  0x00000001U
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW_S  1
/** LCD_CAM_CAM_VSYNC_INT_RAW : RO; bitpos: [2]; default: 0;
 *  The raw bit for LCD_CAM_CAM_VSYNC_INT interrupt.
 */
#define LCD_CAM_CAM_VSYNC_INT_RAW    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_RAW_M  (LCD_CAM_CAM_VSYNC_INT_RAW_V << LCD_CAM_CAM_VSYNC_INT_RAW_S)
#define LCD_CAM_CAM_VSYNC_INT_RAW_V  0x00000001U
#define LCD_CAM_CAM_VSYNC_INT_RAW_S  2
/** LCD_CAM_CAM_HS_INT_RAW : RO; bitpos: [3]; default: 0;
 *  The raw bit for LCD_CAM_CAM_HS_INT interrupt.
 */
#define LCD_CAM_CAM_HS_INT_RAW    (BIT(3))
#define LCD_CAM_CAM_HS_INT_RAW_M  (LCD_CAM_CAM_HS_INT_RAW_V << LCD_CAM_CAM_HS_INT_RAW_S)
#define LCD_CAM_CAM_HS_INT_RAW_V  0x00000001U
#define LCD_CAM_CAM_HS_INT_RAW_S  3

/** LCD_CAM_LC_DMA_INT_ST_REG register
 *  LCD_CAM GDMA masked interrupt status register
 */
#define LCD_CAM_LC_DMA_INT_ST_REG (DR_REG_LCD_CAM_BASE + 0x6c)
/** LCD_CAM_LCD_VSYNC_INT_ST : RO; bitpos: [0]; default: 0;
 *  The status bit for LCD_CAM_LCD_VSYNC_INT interrupt.
 */
#define LCD_CAM_LCD_VSYNC_INT_ST    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_ST_M  (LCD_CAM_LCD_VSYNC_INT_ST_V << LCD_CAM_LCD_VSYNC_INT_ST_S)
#define LCD_CAM_LCD_VSYNC_INT_ST_V  0x00000001U
#define LCD_CAM_LCD_VSYNC_INT_ST_S  0
/** LCD_CAM_LCD_TRANS_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 *  The status bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.
 */
#define LCD_CAM_LCD_TRANS_DONE_INT_ST    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_ST_M  (LCD_CAM_LCD_TRANS_DONE_INT_ST_V << LCD_CAM_LCD_TRANS_DONE_INT_ST_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_ST_V  0x00000001U
#define LCD_CAM_LCD_TRANS_DONE_INT_ST_S  1
/** LCD_CAM_CAM_VSYNC_INT_ST : RO; bitpos: [2]; default: 0;
 *  The status bit for LCD_CAM_CAM_VSYNC_INT interrupt.
 */
#define LCD_CAM_CAM_VSYNC_INT_ST    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_ST_M  (LCD_CAM_CAM_VSYNC_INT_ST_V << LCD_CAM_CAM_VSYNC_INT_ST_S)
#define LCD_CAM_CAM_VSYNC_INT_ST_V  0x00000001U
#define LCD_CAM_CAM_VSYNC_INT_ST_S  2
/** LCD_CAM_CAM_HS_INT_ST : RO; bitpos: [3]; default: 0;
 *  The status bit for LCD_CAM_CAM_HS_INT interrupt.
 */
#define LCD_CAM_CAM_HS_INT_ST    (BIT(3))
#define LCD_CAM_CAM_HS_INT_ST_M  (LCD_CAM_CAM_HS_INT_ST_V << LCD_CAM_CAM_HS_INT_ST_S)
#define LCD_CAM_CAM_HS_INT_ST_V  0x00000001U
#define LCD_CAM_CAM_HS_INT_ST_S  3

/** LCD_CAM_LC_DMA_INT_CLR_REG register
 *  LCD_CAM GDMA interrupt clear register
 */
#define LCD_CAM_LC_DMA_INT_CLR_REG (DR_REG_LCD_CAM_BASE + 0x70)
/** LCD_CAM_LCD_VSYNC_INT_CLR : WO; bitpos: [0]; default: 0;
 *  The clear bit for LCD_CAM_LCD_VSYNC_INT interrupt.
 */
#define LCD_CAM_LCD_VSYNC_INT_CLR    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_CLR_M  (LCD_CAM_LCD_VSYNC_INT_CLR_V << LCD_CAM_LCD_VSYNC_INT_CLR_S)
#define LCD_CAM_LCD_VSYNC_INT_CLR_V  0x00000001U
#define LCD_CAM_LCD_VSYNC_INT_CLR_S  0
/** LCD_CAM_LCD_TRANS_DONE_INT_CLR : WO; bitpos: [1]; default: 0;
 *  The clear bit for LCD_CAM_LCD_TRANS_DONE_INT interrupt.
 */
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR_M  (LCD_CAM_LCD_TRANS_DONE_INT_CLR_V << LCD_CAM_LCD_TRANS_DONE_INT_CLR_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR_V  0x00000001U
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR_S  1
/** LCD_CAM_CAM_VSYNC_INT_CLR : WO; bitpos: [2]; default: 0;
 *  The clear bit for LCD_CAM_CAM_VSYNC_INT interrupt.
 */
#define LCD_CAM_CAM_VSYNC_INT_CLR    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_CLR_M  (LCD_CAM_CAM_VSYNC_INT_CLR_V << LCD_CAM_CAM_VSYNC_INT_CLR_S)
#define LCD_CAM_CAM_VSYNC_INT_CLR_V  0x00000001U
#define LCD_CAM_CAM_VSYNC_INT_CLR_S  2
/** LCD_CAM_CAM_HS_INT_CLR : WO; bitpos: [3]; default: 0;
 *  The clear bit for LCD_CAM_CAM_HS_INT interrupt.
 */
#define LCD_CAM_CAM_HS_INT_CLR    (BIT(3))
#define LCD_CAM_CAM_HS_INT_CLR_M  (LCD_CAM_CAM_HS_INT_CLR_V << LCD_CAM_CAM_HS_INT_CLR_S)
#define LCD_CAM_CAM_HS_INT_CLR_V  0x00000001U
#define LCD_CAM_CAM_HS_INT_CLR_S  3

/** LCD_CAM_LC_REG_DATE_REG register
 *  Version control register
 */
#define LCD_CAM_LC_REG_DATE_REG (DR_REG_LCD_CAM_BASE + 0xfc)
/** LCD_CAM_LC_DATE : R/W; bitpos: [27:0]; default: 33566752;
 *  Version control register
 */
#define LCD_CAM_LC_DATE    0x0FFFFFFFU
#define LCD_CAM_LC_DATE_M  (LCD_CAM_LC_DATE_V << LCD_CAM_LC_DATE_S)
#define LCD_CAM_LC_DATE_V  0x0FFFFFFFU
#define LCD_CAM_LC_DATE_S  0

#ifdef __cplusplus
}
#endif
